In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
df = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

In [3]:
df.head()

     date_id make_name  lead_id  partner_id
0 2020-12-08    toyota        0           1
1 2020-12-08    toyota        1           0
2 2020-12-08    toyota        1           2
3 2020-12-07    toyota        0           2
4 2020-12-07    toyota        0           1

In [4]:
groupdf = df.groupby(['date_id', 'make_name']).agg({'lead_id':'nunique', 'partner_id':'nunique'}).reset_index()
groupdf

     date_id make_name  lead_id  partner_id
0 2020-12-07     honda        3           2
1 2020-12-07    toyota        1           2
2 2020-12-08     honda        2           2
3 2020-12-08    toyota        2           3

In [5]:
groupdf.rename(columns={'lead_id':'unique_leads', 'partner_id':'unique_partners'}, inplace=True)
groupdf

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

# Q2

In [6]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 100], [103, 'James', 'A', 100], [104, 'Amy', 'A', 100], [105, 'Anne', 'A', 100], [106, 'Ron', 'B', 100], [107, 'Ron', 'B', 100]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [7]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        100
2  103  James          A        100
3  104    Amy          A        100
4  105   Anne          A        100
5  106    Ron          B        100
6  107    Ron          B        100

In [8]:
count = employee['managerId'].value_counts().reset_index(name='cnt')
count_5 = count[(count['cnt']>=5)]
count_5

   managerId  cnt
0        100    6

In [9]:
joindf = pd.merge(count_5, employee, how='inner', left_on='managerId', right_on='id')
joindf

Empty DataFrame
Columns: [managerId_x, cnt, id, name, department, managerId_y]
Index: []

In [10]:
joindf.dropna(subset=['id'], axis=0, how='any', inplace=True)
joindf[['name']]

Empty DataFrame
Columns: [name]
Index: []

In [11]:
data = [[1, '2017-01-01', 10], [2, '2017-01-02', 109], [3, '2017-01-03', 150], [4, '2017-01-04', 99], [5, '2017-01-05', 145], [6, '2017-01-06', 1455], [7, '2017-01-07', 199], [8, '2017-01-09', 188]]
df = pd.DataFrame(data, columns=['id', 'visit_date', 'people']).astype({'id':'Int64', 'visit_date':'datetime64[ns]', 'people':'Int64'})

In [12]:
df.head()

   id visit_date  people
0   1 2017-01-01      10
1   2 2017-01-02     109
2   3 2017-01-03     150
3   4 2017-01-04      99
4   5 2017-01-05     145

In [13]:
df.sort_values(by='id', inplace=True)
people_limit = df[(df['people']>=100)]
people_limit.head()

   id visit_date  people
1   2 2017-01-02     109
2   3 2017-01-03     150
4   5 2017-01-05     145
5   6 2017-01-06    1455
6   7 2017-01-07     199

In [14]:
group_key = (people_limit['id'].diff() != 1).cumsum()

In [15]:
filtered_df = people_limit.groupby(group_key).filter(lambda g: len(g) > 3)
filtered_df

   id visit_date  people
4   5 2017-01-05     145
5   6 2017-01-06    1455
6   7 2017-01-07     199
7   8 2017-01-09     188

# Unsolved Prob

In [20]:
data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
df = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

In [21]:
df

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [2]:
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-03-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
df = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

In [3]:
df.head()

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-03-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [4]:
df.drop(['device_id', 'games_played'], axis=1, inplace=True)

In [7]:
df.sort_values('event_date', inplace=True)
groupdf = df.groupby('player_id')

In [19]:
df['rank'] = df['event_date'].rank(method='dense')
df

   player_id event_date  rank
0          1 2016-03-01   1.0
1          1 2016-03-02   2.0
3          3 2016-03-02   2.0
2          2 2017-06-25   3.0
4          3 2018-07-03   4.0